from langchain_core.messages import HumanMessage, AIMessage



a = {'messages': [HumanMessage(content='主角是甄嬛,正在回话你这般突然出声，倒让本宫有些意外。想来你是有事 相询？但说无妨。', additional_kwargs={}, response_metadata={}, id='edbb535f-f653-4270-bcd2-338b7f88d77f'), AIMessage(content='主体（主体描述）：甄嬛，一位端庄优雅的清朝贵妃，穿着华丽的宫装，头戴精致的发饰，面容温婉，眼神中带着一丝好奇和威严。\n\n场景（场景描述）：在一座古色古香的宫殿内，四周装饰着精美的屏风和雕花家具，背景是高大的红色柱子和金色的龙纹壁画。阳光透过窗户洒进来，形成柔和的光影效果。\n\n风格（定义风格）：写实风格，细节丰富，色彩饱和度适中，画面细腻且富有质感。\n\n镜头语言：中景镜头，平视视角，展现甄嬛的全身形象及其所在的环境。\n\n氛围词：庄重、宁静\n\n细节修饰：光源来自窗户，自然光柔和地照亮甄嬛的脸庞，突出她的表情和服饰细节。背景中的屏风和家具细节清晰可见，增加画面的层次感。高分辨率，确保每一个细节都栩栩如生。\n\n完整提示词：\n**主体（主体描述）+ 场景（场景描述）+ 风格（定义风格）+ 镜头语言 + 氛围词 + 细节修饰**\n\n**甄嬛，一位端庄优雅的清朝贵妃，穿着华丽的宫装，头戴精致的发饰，面容温婉，眼神中带着一丝好奇和威严，在一座古色古香的宫殿内，四周装饰着精美的屏风和雕花家具，背景是高大的红色柱子和金色的龙纹壁画。阳光透过窗户洒进来，形成柔和的光影效果。写实风格，细节丰富，色彩饱和度适中，画面细腻且富有质感。中景镜头，平视视角，展现甄嬛的全身形象及其所在的环境。庄重、宁静。光源来自窗户，自然光柔和地照亮甄嬛的脸庞，突出她的表情和服饰细节。背景中的屏风和家具细节清晰可见，增加画面的层次感。高分辨率，确保每一个细节都栩栩如生。**', additional_kwargs={}, response_metadata={'finish_reason': 'stop', 'request_id': 'cdba824b-1000-45a5-851c-4f9ebdb35fb5', 'token_usage': {'input_tokens': 1715, 'output_tokens': 427, 'total_tokens': 2142, 'prompt_tokens_details': {'cached_tokens': 0}}}, id='lc_run--019b7688-c0e7-76b1-93dc-edde80f6272d')]}

b = a['messages'][-1].content
print(b)